{
    "name": "أذكار الصبر",
    "translation_en": "Remembrance of patience",
    "data" : [
        {
            "text" : "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْراً وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى القَوْمِ الكَافِرِينَ" ,
            "translation_en" : "Our Lord! Bestow on us endurance, make our foothold sure, and give us help against the disbelieving folk."
        },
        {
            "text" : "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ" ,
            "translation_en" : "Our Lord! pour out on us patience, and cause us to die as Muslims"
        },
        {
            "text" : "لَّآ اِلٰهَ اِلَّآ اَنْتَ سُبْحٰــنَكَ اِنِّىْ كُنْتُ مِنَ الظّٰلِمِيْنَ" ,
            "translation_en" : "None has the right to be worshipped but You (O Allah), Glorified (and Exalted) are You. Truly, I have been of the wrong-doer"
        },
        {
            "text" : "اللّهُـمَّ رَحْمَتَـكَ أَرْجـوفَلا تَكِلـني إِلى نَفْـسي طَـرْفَةَ عَـيْن، وَأَصْلِـحْ لي شَأْنـي كُلَّـه لَا إِلَهَ إِلَّا أنْـت" ,
            "translation_en" : "O Allah, I hope for Your mercy. Do not leave me to myself even for the blinking of an eye (i.e. a moment). Correct all of my affairs for me. There is none worthy of worship but You"
        },
        {
            "text" : "لا إلَهَ إلاَّ اللَّهُ الْعَظـيمُ الْحَلِـيمْ، لا إلَهَ إلاَّ اللَّهُ رَبُّ العَـرْشِ العَظِيـمِ، لا إلَهَ إلاَّ اللَّهُ رَبُّ السَّمَـوّاتِ ورّبُّ الأَرْضِ ورَبُّ العَرْشِ الكَـريم" ,
            "translation_en" : "There is none worthy of worship but Allah the Mighty, the Forbearing. There is none worthy of worship but Allah, Lord of the Magnificent Throne. There is none worthy of worship but Allah, Lord of the heavens and Lord of the earth, and Lord of the Noble Throne"
        },
        {
            "text" : "حَسْبُـنا اللهُ وَنِعْـمَ الوَكـيل" ,
            "translation_en" : "Allah is sufficient for us and the best of those on whom to depend."
        },
        {
            "text" : "اللّهُـمَّ رَحْمَتَـكَ أَرْجـوفَلا تَكِلـني إِلى نَفْـسي طَـرْفَةَ عَـيْن، وَأَصْلِـحْ لي شَأْنـي كُلَّـه لَا إِلَهَ إِلَّا أنْـت" ,
            "translation_en" : "O Allah, I hope for Your mercy. Do not leave me to myself even for the blinking of an eye (i.e. a moment). Correct all of my affairs for me. There is none worthy of worship but You"
        }
    ]
}